{"tweets": [{"username": "BarackObama", "tweet": "I had some fun answering questions about #APromisedLand for BookTube. I talked to creators about everything from fatherhood, to celebrating science at the White House, to the role strong women played in my life. You can watch the full episode on @YouTube: https://t.co/yCydcrqVW4 https://t.co/VLOBfnjc2z", "replies": ["@BarackObama @YouTube Lifters, claws for privilege? https://t.co/BJnHPgLuir", "@BarackObama @YouTube Lifters, claws for privilege? https://t.co/eU8K66iWN3", "@BarackObama @YouTube It's a great book for you to believe in the power of democracy. Get Barack Obama's book with the assurance of Amazon. https://t.co/XJCORYdng5", "@BarackObama @YouTube https://t.co/sSzGrGNluO please help are family God bless", "@BarackObama @YouTube CON-MAN OBAMA BELONGING JAIL FOR YOUR LIFE!!!\nTRAITOR!!!\nWAKE UP AMERICA!!!", "@BarackObama @YouTube We don't even gotta mention Barack Obama is the very pride of African Americans...", "@BarackObama @YouTube Love it.", "@BarackObama @YouTube well.....the......promiss.......land........It....IS. .....east........for....we.....all.............but.............", "@BarackObama @YouTube I never see your tweets on my TL I have to search for you to see them.  🤷🏾‍♂️", "@BarackObama @willie100000000 @YouTube We love Obama ❤️", "@BarackObama @YouTube Dude. Buddy. We all know you’re gay. No need to take down America because of that notion. Come out and we will accept you. 🙌", "@BarackObama @YouTube Bless to you!", "@BarackObama @YouTube Thank you dad.", "@BarackObama @YouTube Very powerful indeed...", "@BarackObama @YouTube A real friend is one who walks in when the rest of the world walks out.ysrpu", "@BarackObama @YouTube Damn, I love you man, you’re such an inspiration for all mankind! 🖤\nMuch love from Belgium!!! 🇧🇪\n\nPS: Can you give some pointers to our politicians in my country?Cause all of them are so not very busy with their people. 🙂", "@BarackObama @The_Stuart_King @YouTube Worst President ever", "@BarackObama @YouTube A true friend never gets in your way unless you happen to be going down43p60", "@BarackObama @YouTube Funny how your page says “citizen” Ha!", "@BarackObama @YouTube Pigs headed off that cliff by the thousands again. My God is mighty and strong!", "@BarackObama @YouTube OK my idol!", "@BarackObama @YouTube Farmeres are regular sacrificing their life in India we need international pressure on Modi dictator in India whose eleceted by EVM.", "@BarackObama @YouTube As a UK citizen I wish you were still in charge in the US.", "@BarackObama @YouTube Hi Barack. I bought your book. Can you tell Joe and Kamala to keep the promise to wipe out student debt that would have a massive impact and improve everyone’s lives?? Please?", "@BarackObama @YouTube Your wife is a Man", "@BarackObama @YouTube ❤️💫 This is #Everything https://t.co/fDN3CqA0Ov", "@BarackObama @YouTube Great things Mr. President. Thank a lot!", "@BarackObama @YouTube I what’s  to now ,you now is you Was , the seme people  ,who was gonna president in this Time, together of bayden .?", "@BarackObama @YouTube https://t.co/SuiwhKaYSo\n\nEnd racism.   Communism has you by the balls. Is the money worth it?\nWhite communists are using you, have been using you.", "@BarackObama @YouTube Bet played well in Martha’s Vineyard not so well south side of Chicago", "@BarackObama @YouTube Can't wait to read this...been waiting on it! MY FAV! 💙 Thank you for everything you've done for our country 💙", "@BarackObama @YouTube Yet to buy n read the book. Waiting for price to drop a bit😀. But looks like @BarackObama is going to charm that sum out of everyone, me included. An inspiring leader and a charming salesman - what a combo!!", "@BarackObama @YouTube life participation welcome christmas ... send Ethereum even if 0.0000001 to the address below ... those in need are very grateful ... a little bit for you but a lot for them 0xeCA3303abDa767E21e6A94C61E5290200d6ECc46", "@BarackObama @YouTube Received my book today!   I’m excited and I also have it in audio with Obama reading right along with me!  I look forward to viewing @Obama@YouTube!", "@BarackObama @YouTube Wow, never expected to see Mark Rober there", "@BarackObama @YouTube Obama you will be investigated for your crimes one day soon!  Criminality and deception will not be rewarded!", "@BarackObama @YouTube Always Inspiring..", "@BarackObama @YouTube No Thanks."]}, {"username": "BarackObama", "tweet": "There’s just one day left to sign up for heath care during open enrollment. If you or someone you know needs coverage, head to https://t.co/ob1Ynoesod right now to sign up for an affordable plan that works for you and your family.", "replies": ["@BarackObama It's a great book for you to believe in the power of democracy. Get Barack Obama's book with the assurance of Amazon. https://t.co/XJCORYdng5", "@BarackObama I love that you are still here looking out for us. You are tremendous. And we thank you. ♥️", "@BarackObama I know fairy tales come true because I have you. Happy Karwa Chauth My Love.f12c", "@BarackObama It’s not being left out that hurts. It’s not being thought of.yy", "@BarackObama Sir i need help sir i", "@BarackObama The ACA has always been corporate oppression.\n\nOriginally developed by the Heritage Foundation and first put into place by Mitt Romney, it protected and entrenched the profoundly immoral health insurance and pharma industries profiteering off of human suffering and misery.", "@BarackObama Just watch this happen!!\nhttps://t.co/RPQr1oMmou", "@BarackObama I guess you haven’t heard. The plans are not affordable at all.", "@BarackObama Sir i am very poor  I need you to do a small business, you help sir! Please", "@BarackObama Stop the insanity. #Medicare4All #MedicareForAllNOW"]}, {"username": "BarackObama", "tweet": "Georgians, today is the first day of early voting – make a plan to vote right now and vote early if you can. Then, make sure your friends and family in Georgia do the same. https://t.co/nylmAnqEbf", "replies": ["@BarackObama It's a great book for you to believe in the power of democracy. Get Barack Obama's book with the assurance of Amazon. https://t.co/XJCORYdng5", "@BarackObama Don't forget MaskTask...🙏🙏", "@BarackObama 🤖🤖🤖TRUMP BAD🤖🤖🤖🤖JOE GOOD🤖🤖🤖\n🤖🤖🤖TRUST YOUR ROBOT OVERLORDS🤖🤖🤖\n🤖🤖🤖TWITTER AND FACEBOOK ARE 💯🤖🤖🤖"]}, {"username": "BarackObama", "tweet": "Georgia’s runoff election will determine whether the American people have a Senate that’s actually fighting for them. You can get involved right now—make calls, chip in, and do whatever you can to help elect @ReverendWarnock and @Ossoff: https://t.co/NAHvLC1ET9", "replies": ["@BarackObama @ReverendWarnock @ossoff It's a great book for you to believe in the power of democracy. Get Barack Obama's book with the assurance of Amazon. https://t.co/XJCORYdng5"]}, {"username": "BarackObama", "tweet": "Here’s a great way to call voters in Georgia and help them get ready to vote. A couple hours this weekend could help Democrats win the Senate. https://t.co/ITmV9vfQiW", "replies": ["@BarackObama It's a great book for you to believe in the power of democracy. Get Barack Obama's book with the assurance of Amazon. https://t.co/XJCORYdng5", "@BarackObama The only way these two Commies will win is by cheating AGAIN. Warnock is a student of your buddy Rev Wright who was glad 9/11 happened. He is friends w/Farrakhan, another friend of yours, &amp; is anti-white &amp; an anti-Semite. That kind of hate does not belong in Congress! ,", "@BarackObama Are they promising medical for all and stimulus check every month for the duration of the pandemic? All the other country in the world are giving it, why can't the United States ? Do you care about your citizens ? Talk is cheap, we  need real actions."]}, {"username": "realDonaldTrump", "tweet": "“Michigan fraud witness totally debunks Dominion CEO.” @OANN  It was brutal!", "replies": ["@realDonaldTrump @OANN Fake News", "@realDonaldTrump @OANN tRump has more than 50 court losses, Supreme Court throws out ridiculous claims,  his 'ex' AG Barr found nothing, McConnell has recognized Biden as President Elect, absolutely no evidence to backup his claims, and yet this one witness on a far Right media circus matters?? 🤣🤣🤣", "@realDonaldTrump @OANN Sir, this is a @Wendys drive through", "@realDonaldTrump @OANN You lost.  Start packing.", "@realDonaldTrump @OANN LIES LIES AND MORE LIES", "@realDonaldTrump @OANN Why nobody investigating his claim and shut him up fed up with this 🐀 you lost get on with it", "@realDonaldTrump @OANN Nothing makes much sense to you, does it?\nChildren have more common sense than you. \nYou have lost. And you did say that when the electoral college confirmed the winner you would concede and/or stop this childish nonsense. But not \"modest\" 'duck' Trump who knows everything. https://t.co/TMVUX8vM8X", "@realDonaldTrump @OANN Morning Don !! https://t.co/o6Jcl31beM", "@realDonaldTrump @OANN Working to destroy Americs... liars suck.", "@realDonaldTrump @OANN Crazy drunk lady?", "@realDonaldTrump @OANN It over gone start packing. Just take L . You just one term president. https://t.co/RU27koV5gD", "@realDonaldTrump @OANN You cry like a child who had his toys taken away for being a little bitch. Each time you cry about losing, 99% of the country laughs at you. I personally this it is the funniest thing of 2020. Keep up the tears, we all need a good laugh after a year of the tRump virus. #DiaperDon", "@realDonaldTrump @OANN You still lost.", "@realDonaldTrump @OANN Stop whining. You lost. By a landslide in your own words.", "@realDonaldTrump @OANN Donnie look in the mirror what do you see a liar and a sad loser have a nice day https://t.co/a7j2duZTFq", "@realDonaldTrump @OANN At last, we get it... https://t.co/Q3H0nt5OMu", "@realDonaldTrump @OANN Hhhhhhh you're still whining the lost election come on Trump....accept the reality and move on", "@realDonaldTrump @OANN This patriot is with you. My gear is ready, weapons are clean. At the ready sir.", "@realDonaldTrump @OANN Believe in God, He will lead your way!!!", "@realDonaldTrump @OANN IF A WITNESS IN A MURDER CASE HAS MERIT......WHY ARENT THE WITNESSES IN THIS ELECTION FRAUD NOT HAVING MERIT ?", "@realDonaldTrump @OANN Michigan fraud witness (Melissa 'Martini' Carone) was not under oath (again).\n\nI read what she said, and, it in no way debunked the Dominion CEO. She just doesn't understand the technology involved.\n\nHer expertise in these matters was limited to cleaning ink cartridges.", "@realDonaldTrump @OANN And now, the end is near..... https://t.co/Hus2v1e6ZZ", "@realDonaldTrump @OANN Twitter will soon go down in flames for colluding with China to interfere in our election. #WeHaveJustBegun2Fight #StopTheSteal #Rebel1776 #Patriots", "@realDonaldTrump @OANN You must live on fantasy island Donnie where OAN is broadcast from", "@realDonaldTrump @OANN Michigan fraud witness deemed ‘drunk, deranged, and confused’ when trying to debunk Dominion CEO. It was brutal!\n\nTweet fixed ✅", "@realDonaldTrump @OANN Trump need a bottle of warm milk and someone to rub his belly."]}, {"username": "realDonaldTrump", "tweet": "TRUE! https://t.co/YapMxkF4SE", "replies": []}, {"username": "realDonaldTrump", "tweet": "https://t.co/GgwnkrGz9U", "replies": ["@realDonaldTrump Loser.", "@realDonaldTrump Sooo this is what you’re doing with the money you’re begging for all day long?? ☹️☹️😒😒☹️☹️ https://t.co/AIT4ZKsmou"]}, {"username": "JoeBiden", "tweet": "In this battle for the soul of America, democracy prevailed.", "replies": ["@JoeBiden Hey, Sleepy Joe, it's all going to come out. Save yourself the embarrassment and start explaining yourself?!?!", "@JoeBiden Aggressive awareness about this is important", "@JoeBiden @wood_lin Do something about all this crap.  Now DNI stalling, this is ridiculous.  This is a crucial time and nothing is being done.", "@JoeBiden there is no democray when you cheat, interns. Won't happen. 90 million Americans agree. Tell biden, we don't need a compromised man in the office. He can rot in the basement and sniff harris", "@JoeBiden We’re coming for you", "@JoeBiden You are a brazen criminal.", "@JoeBiden Democracy died November 4, 2020.", "@JoeBiden @pjsullivan442 Hey Joe. We are a Republic.", "@JoeBiden What does the constitution say about your claims joe ..... Your a fraud joe... And the world is starting to see it joe... What date is actually in the constitution joe.... Cheaters never win joe...", "@JoeBiden read about islam you find out  happiness.", "@JoeBiden Dead people reign supreme!", "@JoeBiden Thanks President Joe, Thanks Vice President Harris!", "@JoeBiden Judging by the comments to this thread, I think most deserve Biden.", "@JoeBiden Weird", "@JoeBiden you cheated. https://t.co/pNxFfAUIVl", "@JoeBiden So, cheating and lying does pay off.", "@JoeBiden Actually we all are jobless because of your criminals in office including u", "@JoeBiden Because it is a battle for the soul of America, the truth must come out:\n\n- What is your involvement with Hunter and your Brother?\n- Fair and Transparent investigation into election fraud\n- Your mental health", "@JoeBiden If you really want to unite this country then allow a full open and transparent recount prove you won show everything. That shuts up the trump supporters and solidifies your victory.  Address the evidence stop being a politician and using catch phrases. Be honest. Heal.", "@JoeBiden The USA is not a democracy. Stop lying to the people you supposedly represent, Joe. It seems you do not even know the political system in your country. The USA is a Republic of States, not a democracy.", "@JoeBiden Better for you to tell us about your brother and son.  This is team China from the washing office", "@JoeBiden China owns you", "@JoeBiden Mr. Biden, you can give me a residence as an American citizen of Iranian descent and a simple job as a worker. I am an Iranian and I live in Iran. I suffer from poverty, unemployment, discrimination and pressure in my country. I want to come to your country. Please help me.Thank", "@JoeBiden The country which has protected its democracy, it can make the whole world its own.", "@JoeBiden @colbertlateshow @jimmyfallon @jimmykimmel 1st to say🚨Concession Speech will include: “WE LOST THE BATTLE, BUT NOT WAR” “I WILL PARTICIPATE IN A PEACEFUL TRANSFER OF POWER, BUT THIS IS NOT OVER!” ~ Donald J. Trump 1/06/21 🥳 #ConcessionSpeech #Concession #Trump #BidenHarris2020", "@JoeBiden @RosaGonzales7 Absolutely! \nMr President!", "@JoeBiden You are soulless Joe\nWe don’t want anything to do with you https://t.co/3UZ1YD2kqx", "@JoeBiden Joe! Are you a troll or a comedian?", "@JoeBiden NO it did not. But stay tuned !", "@JoeBiden Damn straight. You've already sold yours to China. We'll be damned if we will let you sell ours!", "@JoeBiden Actually, it WILL PREVAIL on Jan 6th when the election is certified &amp; President Trump prevails.\n\nTrump knew. He prepared the battlefield. He has ALL the evidence. The server in Frankfurt confiscated.\n\nOn election night, 11/3, Trump had 410 electoral college votes.\n\n#BidenCheated", "@JoeBiden @JoeBiden hosting jeopardy https://t.co/TQhXKvfYGK", "@JoeBiden WE ARE A REPUBLIC!", "@JoeBiden Troubling the mind serves no purpose. https://t.co/seYcgbZ6LH", "@JoeBiden You’re hilarious.   Do you think we are so stupid?", "@JoeBiden Empty words really, considering that leftist/Marxist/communist typically hold an atheistic world view.", "@JoeBiden Fraud prevailed. Democracy died in darkness because the MSM supported and encouraged the fraud.", "@JoeBiden BITE ME! ASSHOLE! DEM🤮CRACY? #StopTheSteaI2020", "@JoeBiden Yes we did", "@JoeBiden We're hoping it will in the UK too. Do not let Johnson compromise GFA.", "@JoeBiden Yes Sir, that's why the trump administration must be held accountable and the 126 cult members must pay the price", "@JoeBiden Democracy will prevail when we also uphold justice Sir! 🙏🙏🙏\n\nHold Trump and his enablers accountable!", "@JoeBiden Unfortunately you and your evil party agents,big tech donors manipulated the electoral machines and stole votes that didn't belong to you. THIEVES!"]}, {"username": "JoeBiden", "tweet": ".@KamalaHarris and I are building a historic Cabinet.\n\nA Cabinet that looks like America and taps into the best of this nation. https://t.co/RiVfPB9NpJ", "replies": ["@JoeBiden @KamalaHarris It doesn’t look like America. It looks like a group of Democrats.", "@JoeBiden @KamalaHarris Mr. Biden, you can give me a residence as an American citizen of Iranian descent and a simple job as a worker. I am an Iranian and I live in Iran. I suffer from poverty, unemployment, discrimination and pressure in my country. I want to come to your country. Please help me.Thank", "@JoeBiden @KamalaHarris Is that why it's filled by the people that got us into never ending wars and the great recession?", "@JoeBiden @KamalaHarris You will not be president of our country"]}, {"username": "JoeBiden", "tweet": ".@PeteButtigieg has the perspective of a mayor that solves problems and brings people together.\n\nHe’s got the vision of a next-generation leader with the experience and temperament to help dig us out of this economic crisis. https://t.co/zfuy2LCK6R", "replies": []}, {"username": "JoeBiden", "tweet": "As tough as this moment is in the country, as dark as these days of winter seem, I am still more optimistic about the future of this country than I have been my whole career.\n\nThere is nothing beyond America’s capacity if we work together.", "replies": ["@JoeBiden Mr. President really meaningful words,surely nothing is impossible if have full of honest courage and ability to make the right decision in a right time.", "@JoeBiden Mr. Biden, you can give me a residence as an American citizen of Iranian descent and a simple job as a worker. I am an Iranian and I live in Iran. I suffer from poverty, unemployment, discrimination and pressure in my country. I want to come to your country. Please help me.Thank", "@JoeBiden “And the LORD said, \"Behold, they are one people, and they have all one language, and this is only the beginning of what they will do. And nothing that they propose to do will now be impossible for them.”(Genesis 11:6). The next sentence gives pause!", "@JoeBiden I don't know. I was more optimistic last year when we had the best economy in 50 years and no pandemic."]}, {"username": "JoeBiden", "tweet": "Mayor @PeteButtigieg is a barrier-breaking public servant with a track record of forward-thinking leadership. Tune in as I nominate him to be our next Secretary of Transportation. https://t.co/rhpetks9UW", "replies": []}, {"username": "AOC", "tweet": "Yep, journalists have asked me (and others!) this same question for two years and I’ve answered the same way almost every time but for some reason today it’s “news.” (It’s not news)\n\nI am however guilty of the cardinal political sin of clearly answering a journalists’ question https://t.co/N3gXFC6c0e", "replies": ["@AOC It's still doing laundry in public, and I don't vote for that.", "@AOC That's definitely \"your problem\" that people whine about but then it's funny when 45 and others are just publicly rude? Its them being mavericks! \"They speak thier mind!\" But your transparent and respectful and it's a \"problem\" lol.", "@AOC Stop saying something and just do it already.", "@AOC Yaaass! Finally!!!!!", "@AOC sometimes it is better to ZIP your opinions. supported you was happy but not now. we need Peace and that means in party as well as between the parties/ Fight for right not your ego which is what made you think you have to say something outloud just because you think it.."]}]}